'''
= 赋值运算符,把=号右边的结果赋给左边的变量,如num = 1 + 2 * 3,结果num的值为7
'''
# 单个变量赋值
num = 10
print(num)

# 多个变量赋值
num1, num2, f1, str1 = 100, 200, 3.14, "hello"
print(num1)
print(num2)
print(f1)
print(str1)

'''
运算符         描述                   实例
+=       加法赋值运算符        c+=a 等效于 c=c+a
-=       减法赋值运算符        c-=a 等效于 c=c-a
*=       乘法赋值运算符        c*=a 等效于 c=c*a
/=       除法赋值运算符        c/=a 等效于 c=c/a
%=       减法赋值运算符        c%=a 等效于 c=c%a
**=      幂赋值运算符          c**=a 等效于 c=c**a
//=      取整除赋值运算符      c//=a 等效于 c=c//a

其实比较好理解,步进的概念
'''
c = 2
d = 3
c += d
print(c,d)

e = 2
f = 3
e *= f + 2  # 这时候f+2的优先级更高,也就是步进变成5了
print(e,f)  # e=e*(f+2),也就是2*5=10

